import tkinter

win = tkinter.Tk()
win.title("캔버스 위에 미로 찾기 그리기")
#캔버스 바탕
canvas = tkinter.Canvas(width=720, height=720, bg="white")
canvas.pack()

miro =[
[1,1,1,1,1,1,1,1,1,1,1,1],
[1,0,0,0,0,1,1,1,1,1,1,1],
[1,0,1,1,0,0,0,0,0,0,0,1],
[1,0,1,1,0,1,1,0,1,1,0,1],
[1,0,1,1,0,1,1,0,1,1,0,1],
[1,0,1,0,0,1,1,0,1,1,0,0],
[1,0,1,1,1,1,1,0,0,1,0,1],
[1,0,1,1,1,1,1,1,1,1,0,1],
[1,0,1,1,1,1,1,1,1,1,1,1],
[1,0,0,0,0,0,0,0,0,0,1,1],
[1,1,1,1,1,1,1,1,1,0,1,1],
[1,1,1,1,1,1,1,1,1,0,1,1]
]

for y in range(12):
    for x in range(12):
        if miro[y][x] == 1:
            canvas.create_rectangle(x*60, y*60, x*60+60, y*60+60, fill="blue")
win.mainloop()




